main/Catalogs/Вакцины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Вакцины</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВакциныПоКоличествуИнфекцийОтКоторыхОнаЗащищает</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СредняяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бесплатная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отечественная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инфекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инфекция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инфекции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

main/Catalogs/Вакцины/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Инфекция") Тогда
		ТекстЗагловка = НСтр("ru = 'Вакцины от инфекции %1'");
		ТекстЗагловка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗагловка, Параметры.Инфекция);
	Иначе
		ТекстЗагловка = НСтр("ru = 'Вакцины от всех инфекций'");	
	КонецЕсли;
	
	Элементы.Наименование.Заголовок = ТекстЗагловка;
	
	Элементы.ДекорацияПредупреждение.Заголовок = ОбщегоНазначенияКлиентСервер.ТекстПредупрежденияОВакцинах();
	
КонецПроцедуры

#КонецОбласти
